## CONTENT LIST

1. Importing Libraries
2. Importing Data
3. Checking Data
4. Merge df_orders_products_combined with df_prods
5. Export Data

##  1. Importing Libraries

In [44]:
# Import Libraries
import pandas as pd
import numpy as np
import os

##  2. Importing Data

In [45]:
# Importing orders_products_combined Date
df_orders_products_combined = pd.read_pickle(r"C:\Users\heidi\OneDrive\CareerFoundry\Achievement4 Python Fundamentals for Data Analysts\4.2.Jupyter_Fundamentals_and_Python_Data_Types\Instacart Basket Analysis 16-03-2021\02 Data\Prepared Data\orders_products_combined.pkl")

In [46]:
# Create path
path = r"C:\Users\heidi\OneDrive\CareerFoundry\Achievement4 Python Fundamentals for Data Analysts\4.2.Jupyter_Fundamentals_and_Python_Data_Types\Instacart Basket Analysis 16-03-2021"

In [47]:
# Importing products_checked Data
df_prods = pd.read_csv(r'C:\Users\heidi\OneDrive\CareerFoundry\Achievement4 Python Fundamentals for Data Analysts\4.2.Jupyter_Fundamentals_and_Python_Data_Types\Instacart Basket Analysis 16-03-2021\02 Data\Prepared Data\cleaned_prods.csv', index_col = False)

## 3. Checking Data

In [48]:
# Checking the Shape df_orders_products_combined
df_orders_products_combined.shape

(32434489, 12)

Similar number of rows as when exported prior to this task

In [49]:
# View df_orders_products_combined
df_orders_products_combined.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,11.11,196,1,0,both
1,0,0,2539329,1,1,2,8,11.11,14084,2,0,both
2,0,0,2539329,1,1,2,8,11.11,12427,3,0,both
3,0,0,2539329,1,1,2,8,11.11,26088,4,0,both
4,0,0,2539329,1,1,2,8,11.11,26405,5,0,both

In [50]:
# Remove non relevant columns 
df_orders_products_combined.drop(['Unnamed: 0', 'Unnamed: 0.1'],  inplace = True, axis = 1,)

In [51]:
# View df_orders_products_combined after rmoving columns
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,11.11,196,1,0,both
1,2539329,1,1,2,8,11.11,14084,2,0,both
2,2539329,1,1,2,8,11.11,12427,3,0,both
3,2539329,1,1,2,8,11.11,26088,4,0,both
4,2539329,1,1,2,8,11.11,26405,5,0,both

In [52]:
# View df_prods
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [53]:
# Remove non relevant column 
df_prods.drop(['Unnamed: 0'],  inplace = True, axis = 1,)

In [54]:
# View df_prods after rmoving columns
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [55]:
#Checking Shape
df_prods.shape

(49670, 5)

## 4. Merge df_orders_products_combined with df_prods

In [56]:
# Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder 
# from the previous Exercise’s task..

In [57]:
#Merge dfs
df_ords_prods_merged = df_orders_products_combined.merge(df_prods, on = 'product_id')

In [58]:
df_ords_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices
0,2539329,1,1,2,8,11.11,196,1,0,both,Soda,77,7,9.0
1,2398795,1,2,3,7,15.00,196,1,1,both,Soda,77,7,9.0
2,473747,1,3,3,12,21.00,196,1,1,both,Soda,77,7,9.0
3,2254736,1,4,4,7,29.00,196,1,1,both,Soda,77,7,9.0
4,431534,1,5,4,15,28.00,196,1,1,both,Soda,77,7,9.0

In [59]:
df_ords_prods_merged['_merge'].value_counts()

both          32399732
right_only           0
left_only            0
Name: _merge, dtype: int64

In [60]:
df_ords_prods_merged.shape

(32399732, 14)

## Export Data

In [61]:
# Export merged dataframe
df_ords_prods_merged.to_pickle(os.path.join('Prepared Data', 'orders_products_merged.pkl'))